Console.Clear();

//                  Задача 64: Задайте значение N. Напишите программу, которая выведет все натуральные числа в промежутке от N до 1. Выполнить с помощью рекурсии.

// System.Console.Write("Введите любое число:");
// int num = int.Parse(System.Console.ReadLine());

// PrintAllNumm(num);

// static void PrintAllNumm(int number){
//     if(number < 1){
//         return;
//     }
//     System.Console.WriteLine(number);
//     PrintAllNumm(number-1);
// }


//              Задача 66: Задайте значения M и N. Напишите программу, которая найдёт сумму натуральных элементов в промежутке от M до N.

// System.Console.Write("Введите начало промежутка: ");
// int startCounting = int.Parse(Console.ReadLine());
// System.Console.Write("Введите конец промежутка: ");
// int endCounting = int.Parse(Console.ReadLine());

// System.Console.WriteLine(SummBetwean(startCounting,endCounting));

// static int SummBetwean(int start,int end){
//     int summ = 0;
//     for(int i=start; i<=end; i++){
//         summ += i;
//     }
//     return summ;
// }

//              Задача 68: Напишите программу вычисления функции Аккермана с помощью рекурсии. Даны два неотрицательных числа m и n.

// Для решения этой задачи, мне не хватает знаний математики, я все еще школьник и даже описание функции Аккермана в интернете мне сложно понять :(